Revit 2027 API
RebarUpdateCurvesData.IsReversed Property
 Used to store the state of the bar refering to the direction of the bars. This is useful when using face intersection to calculate bars. After mirroring, curves created from intersecting faces may be reversed, so we use this to store the state and keep the rebar pointing in the correct direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsReversed { get; set; }
Public Property IsReversed As Boolean
	Get
	Set
public:
property bool IsReversed {
	bool get ();
	void set (bool value);
}
member IsReversed : bool with get, set
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace